Reports/ГрафикЗамеровПолный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ГрафикЗамеровПолный</Name>
		</Properties>
	</Report>
</MetaDataObject>

Documents/ВыездНаЗамер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыездНаЗамер</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаЗамер</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаИсполнителю</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаЗамер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГабаритныеЧертежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГабаритныйЧертеж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗамерПроизведен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричинаИзменени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПредыдущая</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаИзменения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаявкаНаЗамер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаЗамер</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемыйСтатусЗамера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричинаИзменени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПредыдущая</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаИзменения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОзнакомительныйВыезд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОзнакомительныйВыезд</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ПодготовкаПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГабаритныеЧертежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГабаритныйЧертеж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АктПриемкиПомещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктПриемкиПомещения</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Соглосователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Соглосователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСоглосования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодписьОтозвана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтозвания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтозвания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ГрафикЗамеровПолный/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Проект) Тогда
		Элементы.ПредстоящиеВыезды.Доступность = Истина;
	Иначе
		
		Элементы.ПредстоящиеВыезды.Доступность = Ложь;
		ПредстоящиеВыезды = Истина;
	
	КонецЕсли;
	
	ОбновитьНаСервере();
	
КонецПроцедуры

Процедура ОбновитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

Функция ПолучитьТекстЗапроса()

	Если ПредстоящиеВыезды Тогда
	
		Возврат ТекстЗапросаПредстоящие();	
	
	Иначе
	
		Возврат ТекстЗапросаПоСделке();	
	
	КонецЕсли;

КонецФункции // ПолучитьТекстЗапроса()

Функция ТекстЗапросаПредстоящие() 
	
КонецФункции // ТекстЗапросаПредстоящие()

Функция ТекстЗапросаПоСделке()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыездНаЗамерГабаритныеЧертежи.Помещение КАК Помещение,
		|	"""" КАК Комментарий,
		|	ВыездНаЗамерГабаритныеЧертежи.ЗамерПроизведен КАК ЗамерПроизведен,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.ДатаВыездаПлан КАК ДатаВыездаПлан,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.ДатаВыездаФакт КАК ДатаВыездаФакт,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.Ссылка КАК Ссылка,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.Исполнитель КАК Замерщик,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.Автор КАК Автор,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыЗамера.ПустаяСсылка) КАК СтатусЗамера
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Документ.ВыездНаЗамер.ГабаритныеЧертежи КАК ВыездНаЗамерГабаритныеЧертежи
		|ГДЕ
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.Проект = &Проект
		|	И ВЫБОР
		|			КОГДА &Помещение = ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ &Помещение = ВыездНаЗамерГабаритныеЧертежи.Помещение
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаявкаНаЗамерПомещения.Помещение,
		|	"""",
		|	ЛОЖЬ,
		|	ЗаявкаНаЗамерПомещения.Ссылка.ДатаВыездаПлан,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗаявкаНаЗамерПомещения.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
		|	ЗаявкаНаЗамерПомещения.Ссылка.Автор,
		|	ЗаявкаНаЗамерПомещения.Ссылка.ОжидаемыйСтатусЗамера
		|ИЗ
		|	Документ.ЗаявкаНаЗамер.Помещения КАК ЗаявкаНаЗамерПомещения
		|ГДЕ
		|	ЗаявкаНаЗамерПомещения.Ссылка.Проект = &Проект
		|	И ВЫБОР
		|			КОГДА &Помещение = ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ &Помещение = ЗаявкаНаЗамерПомещения.Помещение
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОзнакомительныйВыездПомещения.Помещение,
		|	ОзнакомительныйВыездПомещения.Комментарий,
		|	ЛОЖЬ,
		|	ОзнакомительныйВыездПомещения.Ссылка.ДатаВыездаПлан,
		|	ОзнакомительныйВыездПомещения.Ссылка.ДатаВыездаФакт,
		|	ОзнакомительныйВыездПомещения.Ссылка,
		|	ОзнакомительныйВыездПомещения.Ссылка.Исполнитель,
		|	ОзнакомительныйВыездПомещения.Ссылка.Автор,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыЗамера.ПустаяСсылка)
		|ИЗ
		|	Документ.ОзнакомительныйВыезд.Помещения КАК ОзнакомительныйВыездПомещения
		|ГДЕ
		|	ОзнакомительныйВыездПомещения.Ссылка.Проект = &Проект
		|	И ВЫБОР
		|			КОГДА &Помещение = ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ &Помещение = ОзнакомительныйВыездПомещения.Помещение
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АктПриемкиПомещенияПомещения.Помещение,
		|	АктПриемкиПомещенияПомещения.Комментарий,
		|	ЛОЖЬ,
		|	АктПриемкиПомещенияПомещения.Ссылка.Дата,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	АктПриемкиПомещенияПомещения.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
		|	АктПриемкиПомещенияПомещения.Ссылка.Автор,
		|	АктПриемкиПомещенияПомещения.Ссылка.НовыйСтатус
		|ИЗ
		|	Документ.АктПриемкиПомещения.Помещения КАК АктПриемкиПомещенияПомещения
		|ГДЕ
		|	АктПриемкиПомещенияПомещения.Ссылка.Проект = &Проект
		|	И ВЫБОР
		|			КОГДА &Помещение = ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ &Помещение = АктПриемкиПомещенияПомещения.Помещение
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Помещение КАК Помещение,
		|	ВЫРАЗИТЬ(вт.Комментарий КАК СТРОКА(100)) КАК Комментарий,
		|	вт.ЗамерПроизведен КАК ЗамерПроизведен,
		|	вт.ДатаВыездаПлан КАК ДатаВыездаПлан,
		|	вт.ДатаВыездаФакт КАК ДатаВыездаФакт,
		|	вт.Ссылка КАК Документ,
		|	вт.Ссылка.Дата КАК Дата,
		|	вт.Замерщик КАК Исполнитель,
		|	вт.Автор КАК Постановщик,
		|	вт.СтатусЗамера КАК СтатусЗамера
		|ИЗ
		|	вт КАК вт
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.ДатаВыездаФакт,
		|	вт.Ссылка,
		|	вт.СтатусЗамера,
		|	вт.ЗамерПроизведен,
		|	вт.Помещение,
		|	вт.ДатаВыездаПлан,
		|	вт.Замерщик,
		|	вт.Автор,
		|	вт.Ссылка.Дата,
		|	ВЫРАЗИТЬ(вт.Комментарий КАК СТРОКА(100))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВыездаПлан
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВыездНаЗамерГабаритныеЧертежи.Ссылка КАК Документ.ВыездНаЗамер) КАК ВыездНаЗамер,
		|	ВыездНаЗамерГабаритныеЧертежи.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
		|	ВыездНаЗамерГабаритныеЧертежи.Комментарий КАК Комментарий,
		|	ВыездНаЗамерГабаритныеЧертежи.ЗамерПроизведен КАК ЗамерПроизведен,
		|	ВыездНаЗамерГабаритныеЧертежи.Помещение КАК Помещение
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыездНаЗамер.ГабаритныеЧертежи КАК ВыездНаЗамерГабаритныеЧертежи
		|		ПО ((ВЫРАЗИТЬ(вт.Ссылка КАК Документ.ВыездНаЗамер)) = ВыездНаЗамерГабаритныеЧертежи.Ссылка)
		|			И (ВЫБОР
		|				КОГДА &Помещение = ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ &Помещение = ВыездНаЗамерГабаритныеЧертежи.Помещение
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫРАЗИТЬ(ВыездНаЗамерГабаритныеЧертежи.Ссылка КАК Документ.ВыездНаЗамер),
		|	ВыездНаЗамерГабаритныеЧертежи.ГабаритныйЧертеж,
		|	ВыездНаЗамерГабаритныеЧертежи.Комментарий,
		|	ВыездНаЗамерГабаритныеЧертежи.ЗамерПроизведен,
		|	ВыездНаЗамерГабаритныеЧертежи.Помещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(вт.Ссылка.Комментарий КАК СТРОКА(100)) КАК КомментарийДокумента,
		|	вт.Ссылка КАК Документ,
		|	вт.Ссылка.СокращенноеНазвание КАК СокращенноеНазвание
		|ИЗ
		|	вт КАК вт
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.Ссылка,
		|	ВЫРАЗИТЬ(вт.Ссылка.Комментарий КАК СТРОКА(100)),
		|	вт.Ссылка.СокращенноеНазвание";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Помещение", Помещение);
	
	Результат = Запрос.ВыполнитьПакет();
	
	тзГЧ = Результат[2].Выгрузить();
	
	тзКомментарий = Результат[3].Выгрузить();
	
	Выборка = Результат[1].Выбрать();
	
	Макет = Отчеты.ГрафикЗамеровПолный.ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Проект = Проект;
	
	ПолеВывода.Очистить();
	
	ПолеВывода.Вывести(Область);
	Область 	= Макет.ПолучитьОбласть("Строка");
	ОбластьГЧ 	= Макет.ПолучитьОбласть("СтрокаГЧ");
	
	стОтбор = Новый Структура("ВыездНаЗамер, Помещение", );
	
	Пока Выборка.Следующий() Цикл
		
		ЕстьВложения = Ложь;
		
		Если ТипЗнч(Выборка.Документ) = Тип("ДокументСсылка.ВыездНаЗамер") Тогда
			
			стОтбор.ВыездНаЗамер 	= Выборка.Документ;
			стОтбор.Помещение 		= Выборка.Помещение;
			
			НайденыеСтроки = тзГЧ.НайтиСтроки(стОтбор);
			
			ЕстьВложения = НайденыеСтроки.Количество() > 0;
			
		КонецЕсли;
		
		Область.Параметры.Заполнить(Выборка); 
		Область.Параметры.Проект = Проект; 
		
		НайденаяСтрока = тзКомментарий.Найти(Выборка.Документ, "Документ");
		
		Если НЕ НайденаяСтрока = Неопределено Тогда
		
			Область.Параметры.КомментарийДокумента 	= НайденаяСтрока.КомментарийДокумента;	
			Область.Параметры.СокращенноеНазвание 	= НайденаяСтрока.СокращенноеНазвание;	
		
		КонецЕсли;
		
		Если ЕстьВложения Тогда
			
			ПолеВывода.НачатьАвтогруппировкуСтрок();	
			ПолеВывода.Вывести(Область, 1, , Ложь);
			Для каждого х Из НайденыеСтроки Цикл
				
				ОбластьГЧ.Параметры.Заполнить(х);
				ОбластьГЧ.Параметры.Проект = Проект; 
				ПолеВывода.Вывести(ОбластьГЧ, 2, , Ложь);
			
			КонецЦикла;
			
			ПолеВывода.ЗакончитьАвтогруппировкуСтрок();	
			
		Иначе
			ПолеВывода.Вывести(Область);
		КонецЕсли; 
		
		
	КонецЦикла;
	

КонецФункции // ТекстЗапросаПоСделке()

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	Элементы.ГруппаПомещение.Видимость = ЗначениеЗаполнено(Помещение); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПомещениеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыводаОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Помещения") Тогда
	
		СтандартнаяОбработка = Ложь;
		Помещение = Расшифровка;
		Элементы.ГруппаПомещение.Видимость = Истина;
		
		ОбновитьНаСервере();
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПомещение(Команда)
	Помещение = Неопределено;
	Элементы.ГруппаПомещение.Видимость = ЗначениеЗаполнено(Помещение); 
	ОбновитьНаСервере();
КонецПроцедуры
